oaq_specification/examples/dot/non_exhaustive_barrier_hierarchical.dot
strict digraph "" {
    node [label="\N"];
    "Frame1" [label="Frame", shape=box];
    "Interval1" [label="100 ns", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval1"  [label="Duration", style=dashed];
    "Instruction3" [label="ModulatedPulse", shape=box];
    "Instruction3" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction3" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians2" [label="1 rad", shape=box];
    "Instruction3" -> "Radians2"  [label="PhaseOffset", style=dashed];
    "Frame2" [label="Frame", shape=box];
    "Interval3" [label="150 ns", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval3"  [label="Duration", style=dashed];
    "Instruction4" [label="ModulatedPulse", shape=box];
    "Instruction4" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction4" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians4" [label="2 rad", shape=box];
    "Instruction4" -> "Radians4"  [label="PhaseOffset", style=dashed];
    "Instruction5:Alignment" [label="StartToStart", shape=box];
    "Instruction5:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction5:Relationship" -> "Instruction5:Alignment"  [label="Alignment", style=dashed];
    "Instruction5" [label="Dependency", shape=box];
    "Instruction5" -> "Instruction5:Relationship"  [label="Relationship", style=dashed];
    "Instruction5" -> "Instruction3"  [label="Lhs", style=dashed];
    "Instruction5" -> "Instruction4"  [label="Rhs", style=dashed];
    "Instruction7" [label="ModulatedPulse", shape=box];
    "Instruction7" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction7" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians5" [label="1 rad", shape=box];
    "Instruction7" -> "Radians5"  [label="PhaseOffset", style=dashed];
    "Instruction8" [label="ModulatedPulse", shape=box];
    "Instruction8" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction8" -> "Waveform2"  [label="Envelope", style=dashed];
    "Radians6" [label="2 rad", shape=box];
    "Instruction8" -> "Radians6"  [label="PhaseOffset", style=dashed];
    "Instruction9:Alignment" [label="StartToStart", shape=box];
    "Instruction9:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction9:Relationship" -> "Instruction9:Alignment"  [label="Alignment", style=dashed];
    "Instruction9" [label="Dependency", shape=box];
    "Instruction9" -> "Instruction9:Relationship"  [label="Relationship", style=dashed];
    "Instruction9" -> "Instruction7"  [label="Lhs", style=dashed];
    "Instruction9" -> "Instruction8"  [label="Rhs", style=dashed];
    "Instruction10:Alignment" [label="EndToStart", shape=box];
    "Instruction10:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction10:Relationship" -> "Instruction10:Alignment"  [label="Alignment", style=dashed];
    "Instruction10" [label="Dependency", shape=box];
    "Instruction10" -> "Instruction10:Relationship"  [label="Relationship", style=dashed];
    "Instruction10" -> "Instruction5"  [label="Lhs", style=dashed];
    "Instruction10" -> "Instruction9"  [label="Rhs", style=dashed];
    "Instruction13" [label="ModulatedPulse", shape=box];
    "Instruction13" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction13" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians7" [label="1 rad", shape=box];
    "Instruction13" -> "Radians7"  [label="PhaseOffset", style=dashed];
    "Frame3" [label="Frame", shape=box];
    "Interval8" [label="50 ns", shape=box];
    "Waveform3" [label="ConstantWaveform", shape=box];
    "Waveform3" -> "Interval8"  [label="Duration", style=dashed];
    "Instruction14" [label="ModulatedPulse", shape=box];
    "Instruction14" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction14" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians9" [label="3 rad", shape=box];
    "Instruction14" -> "Radians9"  [label="PhaseOffset", style=dashed];
    "Instruction15:Alignment" [label="StartToStart", shape=box];
    "Instruction15:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction15:Relationship" -> "Instruction15:Alignment"  [label="Alignment", style=dashed];
    "Instruction15" [label="Dependency", shape=box];
    "Instruction15" -> "Instruction15:Relationship"  [label="Relationship", style=dashed];
    "Instruction15" -> "Instruction13"  [label="Lhs", style=dashed];
    "Instruction15" -> "Instruction14"  [label="Rhs", style=dashed];
    "Instruction17" [label="ModulatedPulse", shape=box];
    "Instruction17" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction17" -> "Waveform1"  [label="Envelope", style=dashed];
    "Radians10" [label="1 rad", shape=box];
    "Instruction17" -> "Radians10"  [label="PhaseOffset", style=dashed];
    "Instruction18" [label="ModulatedPulse", shape=box];
    "Instruction18" -> "Frame3"  [label="Frame", style=dashed];
    "Instruction18" -> "Waveform3"  [label="Envelope", style=dashed];
    "Radians11" [label="3 rad", shape=box];
    "Instruction18" -> "Radians11"  [label="PhaseOffset", style=dashed];
    "Instruction19:Alignment" [label="StartToStart", shape=box];
    "Instruction19:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction19:Relationship" -> "Instruction19:Alignment"  [label="Alignment", style=dashed];
    "Instruction19" [label="Dependency", shape=box];
    "Instruction19" -> "Instruction19:Relationship"  [label="Relationship", style=dashed];
    "Instruction19" -> "Instruction17"  [label="Lhs", style=dashed];
    "Instruction19" -> "Instruction18"  [label="Rhs", style=dashed];
    "Instruction20:Alignment" [label="EndToStart", shape=box];
    "Instruction20:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction20:Relationship" -> "Instruction20:Alignment"  [label="Alignment", style=dashed];
    "Instruction20" [label="Dependency", shape=box];
    "Instruction20" -> "Instruction20:Relationship"  [label="Relationship", style=dashed];
    "Instruction20" -> "Instruction15"  [label="Lhs", style=dashed];
    "Instruction20" -> "Instruction19"  [label="Rhs", style=dashed];
}
